class FunConfig {
  ///快捷修改
  static const List startData = [
    '渣机画质',
    '流畅画质',
    '超高清画质',
    '超极限画质',
    '8P原生画质',
    '不求人同款'
  ];

  ///多样化修改
  static const List diversifyData = ['专属修改', '一键修改'];

  ///机型修改
  static const List modelData = ['低端机', '中端机', '高端机'];

  ///性能优化
  static const List openData = [
    {
      'title': '修复闪退',
      'subtitle': '是否修复闪退，如部分华为 OPPO VIVO等机型，可通过修复解决！',
    },
    {
      'title': 'EPlus优化',
      'subtitle': '是否注入EPlus优化，将会减少发热掉帧，并清理后台所运行的程序，把流畅度优化到极致！'
    },
    {
      'title': '处理器超频',
      'subtitle':
          '什么是处理器超频？是一款只支持高通骁龙处理器大核小核的调节软件，可调满血或者锁定频率，无需手机Root权限。软件需要开启后台服务才会一直有效，所以建议你将超频软件加入白名单防止杀后台！',
    },
  ];

  ///其他功能
  static const List otherData = [
    {
      'title': '解锁画质+120帧',
      'subtitle': '是否解锁画质+120帧？若出现问题请到首页还原画质！',
    },
    {
      'title': '解锁超高音质',
      'subtitle': '是否解锁音质？若出现问题请到首页还原音质！',
    },
    {
      'title': '还原功能',
      'subtitle': '请选择需要还原的选项，还原前请先退出游戏并清理游戏后台！',
    },
    {
      'title': '陀螺仪优化',
      'subtitle':
          '目前有2种优化方法\n1.提高陀螺仪灵敏度\n2.优化陀螺仪速度\n\n点击“1K陀螺仪”自动复制分享码，然后到游戏里输入使用即可\n点击“优化陀螺仪”，即可优化陀螺仪速度，渣机的神仙利器！',
    },
  ];

  ///专属修改
  static const List useZsxgData = [
    '高优化/低纹理/高地面材质',
    '1.25分辨率/中纹理/中清晰度/中阴影',
    '120帧数/2K分辨率',
    '主播同款/流畅/极限/高优化',
    '高清/4倍抗锯齿/中纹理',
    '均衡/2倍分辨率/低纹理',
    '高优化/HDR高清/高纹理',
    '骁龙优化/HDR高清/高纹理/高阴影',
    'HDR高清/4倍抗锯齿/高纹理',
    '联发科优化/均衡/4倍抗锯齿/极限',
    '高清/4倍抗锯齿/高纹理/高阴影',
    '高清/中阴影/中纹理'
  ];

  ///一键修改
  static const List useYjxgData = [
    '流畅/极限/鲜艳',
    '高优化/流畅/钢枪专用',
    '高优化/低端机/流畅/极限',
    'HDR高清/2K画质/看风景',
    '高清/高纹理/中反光',
    'HDR高清/中端机优化/极限',
    'HDR高清/中纹理/中反光',
    '中端机优化/中抗锯齿/极限',
    'HDR高清/全超高/火力全开',
    '联发科优化/HDR高清/钢枪/极限',
    '流畅/高纹理/高反光/4倍抗锯齿',
    '高端机优化/HDR高清/钢枪/极限'
  ];

  ///低端机
  static const List useDdjData = [
    '低端机钢枪不卡',
    '渣机极致画质',
    '流畅钢枪',
    '低端机画质',
    '无任何特效远视距',
    '流畅鲜艳看人清楚',
    '流畅画质全部最低',
    '丝滑无比柔和画质流畅',
    '流畅渣机画质',
    '钢枪不卡落地不卡',
    '钢枪不卡画质',
    '鲜艳流畅钢枪'
  ];

  ///中端机
  static const List useZdjData = [
    '稳定帧率画质',
    '1K分辨率超远视距HDR渲染',
    '高清画质',
    '流畅60帧无阴影',
    '特效不错全程看风景渣机勿扰',
    '流畅钢枪',
    '高清画质钢枪',
    '看人清晰钢枪不卡',
    '写实流畅钢枪',
    '钢枪不卡不发热',
    '极限帧不掉帧',
  ];

  ///高端机
  static const List useGdjData = [
    '超强粒子特效鲜艳强大画质顶级',
    '特效基本全开反光阴影HDR电影',
    'HDR高清高纹理高阴影高反光',
    '高反光高远视2K分辨率流畅',
    '超高清顶级画质渣机勿扰',
    '超极限画质2K分辨率',
    '远处看人清楚特效全开',
    '超级流畅画质纵享丝滑',
    '特效全部最高渣机勿扰',
    '超高清2K画质'
  ];
}
